Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.2.112/samrh71c/xc32/ATSAMRH71F20C/startup_atsamrh71f20c.c
#else /* Legacy defined(_SAMRH71F20C_H) */
        /* Configurable interrupts with Legacy names */
        /* .pfnSUPC_Handler         = */ (void*) SUPC_Handler,        /* 0  Supply Controller */
        /* .pfnRSTC_Handler         = */ (void*) RSTC_Handler,        /* 1  Reset Controller */
        /* .pfnRTC_Handler          = */ (void*) RTC_Handler,         /* 2  Real-time Clock */
        /* .pfnRTT_Handler          = */ (void*) RTT_Handler,         /* 3  Real-time Timer */
        /* .pfnWDT_Handler          = */ (void*) WDT_Handler,         /* 4  Watchdog Timer */
        /* .pfnPMC_Handler          = */ (void*) PMC_Handler,         /* 5  Power Management Controller */
        /* .pfnMATRIX0_Handler      = */ (void*) MATRIX0_Handler,     /* 6  AHB Bus Matrix */
        /* .pfnFLEXCOM0_Handler     = */ (void*) FLEXCOM0_Handler,    /* 7  Flexible Serial Communication */
        /* .pfnFLEXCOM1_Handler     = */ (void*) FLEXCOM1_Handler,    /* 8  Flexible Serial Communication */
        /* .pfnNMIC_Handler         = */ (void*) NMIC_Handler,        /* 9  Non-maskable Interrupt Controller */
        /* .pfnPIOA_Handler         = */ (void*) PIOA_Handler,        /* 10 Parallel Input/Output Controller */
        /* .pfnPIOB_Handler         = */ (void*) PIOB_Handler,        /* 11 Parallel Input/Output Controller */
        /* .pfnPIOC_Handler         = */ (void*) PIOC_Handler,        /* 12 Parallel Input/Output Controller */
        /* .pfnFLEXCOM2_Handler     = */ (void*) FLEXCOM2_Handler,    /* 13 Flexible Serial Communication */
        /* .pfnFLEXCOM3_Handler     = */ (void*) FLEXCOM3_Handler,    /* 14 Flexible Serial Communication */
        /* .pfnFLEXCOM4_Handler     = */ (void*) FLEXCOM4_Handler,    /* 15 Flexible Serial Communication */
        /* .pfnPIOD_Handler         = */ (void*) PIOD_Handler,        /* 16 Parallel Input/Output Controller */
        /* .pfnPIOE_Handler         = */ (void*) PIOE_Handler,        /* 17 Parallel Input/Output Controller */
        /* .pfnCCW_Handler          = */ (void*) CCW_Handler,         /* 18 System Control Block */
        /* .pfnCCF_Handler          = */ (void*) CCF_Handler,         /* 19 System Control Block */
        /* .pfnFPU_Handler          = */ (void*) FPU_Handler,         /* 20 Floating Point Unit */
        /* .pfnIXC_Handler          = */ (void*) IXC_Handler,         /* 21 Floating Point Unit */
        /* .pfnFLEXCOM5_Handler     = */ (void*) FLEXCOM5_Handler,    /* 22 Flexible Serial Communication */
        /* .pfnFLEXCOM6_Handler     = */ (void*) FLEXCOM6_Handler,    /* 23 Flexible Serial Communication */
        /* .pfnFLEXCOM7_Handler     = */ (void*) FLEXCOM7_Handler,    /* 24 Flexible Serial Communication */
        /* .pfnTC0_Handler          = */ (void*) TC0_Handler,         /* 25 Timer Counter */
        /* .pfnTC1_Handler          = */ (void*) TC1_Handler,         /* 26 Timer Counter */
        /* .pfnTC2_Handler          = */ (void*) TC2_Handler,         /* 27 Timer Counter */
        /* .pfnTC3_Handler          = */ (void*) TC3_Handler,         /* 28 Timer Counter */
        /* .pfnTC4_Handler          = */ (void*) TC4_Handler,         /* 29 Timer Counter */
        /* .pfnTC5_Handler          = */ (void*) TC5_Handler,         /* 30 Timer Counter */
        /* .pfnPWM0_Handler         = */ (void*) PWM0_Handler,        /* 31 Pulse Width Modulation Controller */
        /* .pfnPWM1_Handler         = */ (void*) PWM1_Handler,        /* 32 Pulse Width Modulation Controller */
        /* .pfnICM_Handler          = */ (void*) ICM_Handler,         /* 33 Integrity Check Monitor */
        /* .pfnPIOF_Handler         = */ (void*) PIOF_Handler,        /* 34 Parallel Input/Output Controller */
        /* .pfnPIOG_Handler         = */ (void*) PIOG_Handler,        /* 35 Parallel Input/Output Controller */
        /* .pfnMCAN0_INT0_Handler   = */ (void*) MCAN0_INT0_Handler,  /* 36 Controller Area Network */
        /* .pfnMCAN0_INT1_Handler   = */ (void*) MCAN0_INT1_Handler,  /* 37 Controller Area Network */
        /* .pfnMCAN1_INT0_Handler   = */ (void*) MCAN1_INT0_Handler,  /* 38 Controller Area Network */
        /* .pfnMCAN1_INT1_Handler   = */ (void*) MCAN1_INT1_Handler,  /* 39 Controller Area Network */
        /* .pfnTCMECC_INTFIX_Handler = */ (void*) TCMECC_INTFIX_Handler, /* 40 HECC */
        /* .pfnTCMECC_INTNOFIX_Handler = */ (void*) TCMECC_INTNOFIX_Handler, /* 41 HECC */
        /* .pfnFLEXRAMECC_INTFIX_Handler = */ (void*) FLEXRAMECC_INTFIX_Handler, /* 42 FLEXRAMECC */
        /* .pfnFLEXRAMECC_INTNOFIX_Handler = */ (void*) FLEXRAMECC_INTNOFIX_Handler, /* 43 FLEXRAMECC */
        /* .pfnSHA_Handler          = */ (void*) SHA_Handler,         /* 44 Secure Hash Algorithm */
        /* .pfnFLEXCOM8_Handler     = */ (void*) FLEXCOM8_Handler,    /* 45 Flexible Serial Communication */
        /* .pfnFLEXCOM9_Handler     = */ (void*) FLEXCOM9_Handler,    /* 46 Flexible Serial Communication */
        /* .pfnRSWDT_Handler        = */ (void*) RSWDT_Handler,       /* 47 Reinforced Safety Watchdog Timer */
        /* .pvReserved48            = */ (void*) (0UL),               /* 48 Reserved */
        /* .pfnQSPI_Handler         = */ (void*) QSPI_Handler,        /* 49 Quad Serial Peripheral Interface */
        /* .pfnHEFC_INT0_Handler    = */ (void*) HEFC_INT0_Handler,   /* 50 Harden Embedded Flash Controller */
        /* .pfnHEFC_INTFIX_Handler  = */ (void*) HEFC_INTFIX_Handler, /* 51 Harden Embedded Flash Controller */
        /* .pfnHEFC_INTNOFIX_Handler = */ (void*) HEFC_INTNOFIX_Handler, /* 52 Harden Embedded Flash Controller */
        /* .pfnTC6_Handler          = */ (void*) TC6_Handler,         /* 53 Timer Counter */
        /* .pfnTC7_Handler          = */ (void*) TC7_Handler,         /* 54 Timer Counter */
        /* .pfnTC8_Handler          = */ (void*) TC8_Handler,         /* 55 Timer Counter */
        /* .pfnTC9_Handler          = */ (void*) TC9_Handler,         /* 56 Timer Counter */
        /* .pfnTC10_Handler         = */ (void*) TC10_Handler,        /* 57 Timer Counter */
        /* .pfnTC11_Handler         = */ (void*) TC11_Handler,        /* 58 Timer Counter */
        /* .pfnHEMC_INTSDRAMC_Handler = */ (void*) HEMC_INTSDRAMC_Handler, /* 59 HEMC */
        /* .pfnHEMC_INTFIX_Handler  = */ (void*) HEMC_INTFIX_Handler, /* 60 HEMC */
        /* .pfnHEMC_INTNOFIX_Handler = */ (void*) HEMC_INTNOFIX_Handler, /* 61 HEMC */
        /* .pfnSFR_Handler          = */ (void*) SFR_Handler,         /* 62 Special Function Registers */
        /* .pfnTRNG_Handler         = */ (void*) TRNG_Handler,        /* 63 True Random Number Generator */
        /* .pfnXDMAC_Handler        = */ (void*) XDMAC_Handler,       /* 64 Extensible DMA Controller */
        /* .pfnSPW_Handler          = */ (void*) SPW_Handler,         /* 65 SpW */
        /* .pvReserved66            = */ (void*) (0UL),               /* 66 Reserved */
        /* .pvReserved67            = */ (void*) (0UL),               /* 67 Reserved */
        /* .pfnIP1553_Handler       = */ (void*) IP1553_Handler,      /* 68 IP 1553 */
        /* .pfnGMAC_Handler         = */ (void*) GMAC_Handler,        /* 69 Gigabit Ethernet MAC */
        /* .pfnGMAC_Q1_Handler      = */ (void*) GMAC_Q1_Handler,     /* 70 Gigabit Ethernet MAC */
        /* .pfnGMAC_Q2_Handler      = */ (void*) GMAC_Q2_Handler,     /* 71 Gigabit Ethernet MAC */
        /* .pfnGMAC_Q3_Handler      = */ (void*) GMAC_Q3_Handler,     /* 72 Gigabit Ethernet MAC */
        /* .pfnGMAC_Q4_Handler      = */ (void*) GMAC_Q4_Handler,     /* 73 Gigabit Ethernet MAC */
        /* .pfnGMAC_Q5_Handler      = */ (void*) GMAC_Q5_Handler      /* 74 Gigabit Ethernet MAC */
#endif
};

#if (__ARM_FP==14) || (__ARM_FP==4)
/* These functions are used only when compiling with -mfloat-abi=softfp or -mfloat-abi=hard */
/* Save and restore IRQs */
typedef uint32_t irqflags_t;
static bool g_interrupt_enabled;
#define cpu_irq_is_enabled()    (__get_PRIMASK() == 0)
#  define cpu_irq_enable()                             \
        do {                                           \
                g_interrupt_enabled = true;            \
                __DMB();                               \
                __enable_irq();                        \
        } while (0)
#  define cpu_irq_disable()                            \
        do {                                           \
                __disable_irq();                       \
                __DMB();                               \
                g_interrupt_enabled = false;           \
        } while (0)
__always_inline __STATIC_INLINE bool __attribute__((optimize("-O1"))) cpu_irq_is_enabled_flags(irqflags_t flags)
{
        return (flags);
}
__always_inline __STATIC_INLINE void __attribute__((optimize("-O1"))) cpu_irq_restore(irqflags_t flags)
{
        if (cpu_irq_is_enabled_flags(flags))
                cpu_irq_enable();
}
__always_inline __STATIC_INLINE __attribute__((optimize("-O1"))) irqflags_t cpu_irq_save(void)
{
        volatile irqflags_t flags = cpu_irq_is_enabled();
        cpu_irq_disable();
        return flags;
}

/** Address for ARM CPACR */
#define ADDR_CPACR 0xE000ED88
/** CPACR Register */
#define REG_CPACR  (*((volatile uint32_t *)ADDR_CPACR))

/**
* \brief Enable FPU
*/
__always_inline __STATIC_INLINE void __attribute__((optimize("-O1"))) fpu_enable(void)
{
    irqflags_t flags;
    flags = cpu_irq_save();
    REG_CPACR |=  (0xFu << 20);
    __DSB();
    __ISB();
    cpu_irq_restore(flags);
}
#endif /* (__ARM_FP==14) || (__ARM_FP==4) */
 
